src/cfe/КСП/DataProcessors/КСП_ДиспетчерРаспределенияГотовойПродукции.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<DataProcessor>
		<Properties>
			<Name>КСП_ДиспетчерРаспределенияГотовойПродукции</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СкладОстатков</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Распределение</Name>
					<Type>
						<v8:Type>v8:ValueTree</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРаспределения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СценарийПланирования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СценарииТоварногоПланирования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеОпт</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеРозница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеECOM</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/cfe/КСП/AccumulationRegisters/ПланыПродаж.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<AccumulationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ПланыПродаж</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КЗаказу</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Сценарий</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СценарииТоварногоПланирования</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыПланов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/cfe/КСП/InformationRegisters/РаспределениеЗапасов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>РаспределениеЗапасов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Резерв</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Свободно</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Зарезервировано</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Обеспечено</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НеОбеспечено</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КОбеспечениюБезРезерва</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОтложитьРезервирование</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РезервироватьПоМереПоступления</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Резервировать</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Склад</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.РаспределениеЗапасовСостояния</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Назначение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Назначения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЗаказНаОтгрузку</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОжидаемаяОтгрузка</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаПоступления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЗаказНаПоступление</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОжидаемоеПоступление</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cfe/КСП/Enums/РаспределениеЗапасовСостояния.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>РаспределениеЗапасовСостояния</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВРезерве</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cfe/КСП/Enums/КСП_ТипДокументаСлужебногоРезерва.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Enum>
		<Properties>
			<Name>КСП_ТипДокументаСлужебногоРезерва</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>РаспределениеГотовойПродукции</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cfe/КСП/Enums/СтатусыПланов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>СтатусыПланов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВПодготовке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Утвержден</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Отменен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НаУтверждении</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cfe/КСП/Enums/ХозяйственныеОперации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ХозяйственныеОперации</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СписаниеТоваровПоТребованию</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПередачаВЭксплуатацию</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cfe/КСП/DataProcessors/КСП_ДиспетчерРаспределенияГотовойПродукции/Ext/ObjectModule.bsl
#Область ПрограммныйИнтерфейс

Процедура ЗаполнитьРаспределение() Экспорт
	
	ИнициализироватьДеревоРаспределения();
	
	СостоянияРаспределения = Перечисления.РаспределениеЗапасовСостояния;
	СостоянияДоступности = Новый Массив;
	СостоянияДоступности.Добавить(СостоянияРаспределения.ОстатокНаСкладе);
	СостоянияДоступности.Добавить(СостоянияРаспределения.ОжидаемоеПоступление);
	СостоянияДоступности.Добавить(СостоянияРаспределения.ОбеспеченНаСкладе);
	СостоянияДоступности.Добавить(СостоянияРаспределения.ОбеспеченКДате);
	СостоянияДоступности.Добавить(СостоянияРаспределения.Обеспечить);
	СостоянияДоступности.Добавить(СостоянияРаспределения.ВРезерве);
	
	ТипДокументаРаспределение = Перечисления.КСП_ТипДокументаСлужебногоРезерва.РаспределениеГотовойПродукции;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаНачала",					НачалоГода(ДатаРаспределения));
	Запрос.УстановитьПараметр("ДатаОкончания",				ДатаРаспределения);
	Запрос.УстановитьПараметр("СкладОстатков",				СкладОстатков);
	Запрос.УстановитьПараметр("СценарийПланирования",		СценарийПланирования);
	Запрос.УстановитьПараметр("ПодразделениеОпт",			ПодразделениеОпт);
	Запрос.УстановитьПараметр("ПодразделениеРозница",		ПодразделениеРозница);
	Запрос.УстановитьПараметр("ПодразделениеECOM",			ПодразделениеECOM);
	Запрос.УстановитьПараметр("СостоянияДоступности",		СостоянияДоступности);
	Запрос.УстановитьПараметр("ТипДокументаРаспределение",	ТипДокументаРаспределение);
	
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ПланыПродажОбороты.Номенклатура КАК Номенклатура,
	|	ПланыПродажОбороты.Характеристика КАК Характеристика,
	|	ПланыПродажОбороты.Подразделение КАК Подразделение,
	|	ПланыПродажОбороты.КоличествоОборот КАК Количество
	|ПОМЕСТИТЬ втПланыПродаж
	|ИЗ
	|	РегистрНакопления.ПланыПродаж.Обороты(
	|			&ДатаНачала,
	|			&ДатаОкончания,
	|			,
	|			Сценарий = &СценарийПланирования
	|				И Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПланов.Утвержден)
	|				И Подразделение В (&ПодразделениеОпт, &ПодразделениеРозница, &ПодразделениеECOM)) КАК ПланыПродажОбороты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Влож.Номенклатура КАК Номенклатура,
	|	Влож.НоменклатураНаименование КАК НоменклатураНаименование,
	|	Влож.Характеристика КАК Характеристика,
	|	СУММА(ВЫБОР
	|			КОГДА Влож.Подразделение = &ПодразделениеОпт
	|				ТОГДА Влож.Запланировано
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК КоличествоПлановоеОпт,
	|	СУММА(ВЫБОР
	|			КОГДА Влож.Подразделение = &ПодразделениеРозница
	|				ТОГДА Влож.Запланировано
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК КоличествоПлановоеРозница,
	|	СУММА(ВЫБОР
	|			КОГДА Влож.Подразделение = &ПодразделениеECOM
	|				ТОГДА Влож.Запланировано
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК КоличествоПлановоеECOM,
	|	СУММА(Влож.Свободно) КАК КоличествоОстаток,
	|	СУММА(Влож.Свободно) КАК КоличествоДоступно,
	|	СУММА(ВЫБОР
	|			КОГДА Влож.Подразделение = &ПодразделениеОпт
	|				ТОГДА Влож.Зарезервировано
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК КоличествоРаспределеноОпт,
	|	СУММА(ВЫБОР
	|			КОГДА Влож.Подразделение = &ПодразделениеРозница
	|				ТОГДА Влож.Зарезервировано
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК КоличествоРаспределеноРозница,
	|	СУММА(ВЫБОР
	|			КОГДА Влож.Подразделение = &ПодразделениеECOM
	|				ТОГДА Влож.Зарезервировано
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК КоличествоРаспределеноECOM
	|ПОМЕСТИТЬ втИтоговыеДанные
	|ИЗ
	|	(ВЫБРАТЬ
	|		ИнформацияОДоступности.Номенклатура КАК Номенклатура,
	|		ИнформацияОДоступности.Характеристика КАК Характеристика,
	|		ИнформацияОДоступности.Свободно КАК Свободно,
	|		0 КАК Зарезервировано,
	|		0 КАК Запланировано,
	|		СпрНоменклатура.Наименование КАК НоменклатураНаименование,
	|		NULL КАК Подразделение
	|	ИЗ
	|		РегистрСведений.РаспределениеЗапасов КАК ИнформацияОДоступности
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
	|			ПО (СпрНоменклатура.Ссылка = ИнформацияОДоступности.Номенклатура)
	|	ГДЕ
	|		ИнформацияОДоступности.Состояние В(&СостоянияДоступности)
	|		И ИнформацияОДоступности.Свободно <> 0
	|		И ИнформацияОДоступности.Склад = &СкладОстатков
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ИнформацияОДоступности.Номенклатура,
	|		ИнформацияОДоступности.Характеристика,
	|		0,
	|		ИнформацияОДоступности.Зарезервировано,
	|		0,
	|		СпрНоменклатура.Наименование,
	|		ДокРаспределения.Подразделение
	|	ИЗ
	|		РегистрСведений.РаспределениеЗапасов КАК ИнформацияОДоступности
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
	|			ПО (СпрНоменклатура.Ссылка = ИнформацияОДоступности.Номенклатура)
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказНаВнутреннееПотребление КАК ДокРаспределения
	|			ПО (ДокРаспределения.Ссылка = ИнформацияОДоступности.ЗаказНаОтгрузку)
	|	ГДЕ
	|		ИнформацияОДоступности.Состояние = ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ВРезерве)
	|		И ИнформацияОДоступности.Зарезервировано <> 0
	|		И ИнформацияОДоступности.Склад = &СкладОстатков
	|		И ДокРаспределения.КСП_ТипДокументаСлужебногоРезерва = &ТипДокументаРаспределение
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		втПланыПродаж.Номенклатура,
	|		втПланыПродаж.Характеристика,
	|		0,
	|		0,
	|		втПланыПродаж.Количество,
	|		СпрНоменклатура.Наименование,
	|		втПланыПродаж.Подразделение
	|	ИЗ
	|		втПланыПродаж КАК втПланыПродаж
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
	|			ПО (СпрНоменклатура.Ссылка = втПланыПродаж.Номенклатура)) КАК Влож
	|
	|СГРУППИРОВАТЬ ПО
	|	Влож.Номенклатура,
	|	Влож.НоменклатураНаименование,
	|	Влож.Характеристика
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втИтоговыеДанные.Номенклатура КАК Номенклатура,
	|	втИтоговыеДанные.НоменклатураНаименование КАК НоменклатураНаименование,
	|	втИтоговыеДанные.Характеристика КАК Характеристика,
	|	втИтоговыеДанные.КоличествоПлановоеОпт КАК КоличествоПлановоеОпт,
	|	втИтоговыеДанные.КоличествоПлановоеРозница КАК КоличествоПлановоеРозница,
	|	втИтоговыеДанные.КоличествоПлановоеECOM КАК КоличествоПлановоеECOM,
	|	втИтоговыеДанные.КоличествоОстаток КАК КоличествоОстаток,
	|	втИтоговыеДанные.КоличествоДоступно КАК КоличествоДоступно,
	|	втИтоговыеДанные.КоличествоРаспределеноОпт КАК КоличествоРаспределеноОпт,
	|	втИтоговыеДанные.КоличествоРаспределеноРозница КАК КоличествоРаспределеноРозница,
	|	втИтоговыеДанные.КоличествоРаспределеноECOM КАК КоличествоРаспределеноECOM,
	|	ВЫБОР
	|		КОГДА втИтоговыеДанные.КоличествоПлановоеОпт > 0
	|			ТОГДА втИтоговыеДанные.КоличествоРаспределеноОпт / втИтоговыеДанные.КоличествоПлановоеОпт
	|		ИНАЧЕ 0
	|	КОНЕЦ * 100 КАК ПроцентОбеспеченияОпт,
	|	ВЫБОР
	|		КОГДА втИтоговыеДанные.КоличествоПлановоеРозница > 0
	|			ТОГДА втИтоговыеДанные.КоличествоРаспределеноРозница / втИтоговыеДанные.КоличествоПлановоеРозница
	|		ИНАЧЕ 0
	|	КОНЕЦ * 100 КАК ПроцентОбеспеченияРозница,
	|	ВЫБОР
	|		КОГДА втИтоговыеДанные.КоличествоПлановоеECOM > 0
	|			ТОГДА втИтоговыеДанные.КоличествоРаспределеноECOM / втИтоговыеДанные.КоличествоПлановоеECOM
	|		ИНАЧЕ 0
	|	КОНЕЦ * 100 КАК ПроцентОбеспеченияECOM
	|ИЗ
	|	втИтоговыеДанные КАК втИтоговыеДанные
	|
	|УПОРЯДОЧИТЬ ПО
	|	втИтоговыеДанные.НоменклатураНаименование
	|ИТОГИ
	|	СУММА(КоличествоПлановоеОпт),
	|	СУММА(КоличествоПлановоеРозница),
	|	СУММА(КоличествоПлановоеECOM),
	|	СУММА(КоличествоОстаток),
	|	СУММА(КоличествоДоступно),
	|	СУММА(КоличествоРаспределеноОпт),
	|	СУММА(КоличествоРаспределеноРозница),
	|	СУММА(КоличествоРаспределеноECOM),
	|	ВЫБОР
	|		КОГДА СУММА(втИтоговыеДанные.КоличествоПлановоеОпт) = 0
	|			ТОГДА 0
	|		ИНАЧЕ СУММА(втИтоговыеДанные.КоличествоРаспределеноОпт) / СУММА(втИтоговыеДанные.КоличествоПлановоеОпт)
	|	КОНЕЦ * 100 КАК ПроцентОбеспеченияОпт,
	|	ВЫБОР
	|		КОГДА СУММА(втИтоговыеДанные.КоличествоПлановоеРозница) = 0
	|			ТОГДА 0
	|		ИНАЧЕ СУММА(втИтоговыеДанные.КоличествоРаспределеноРозница) / СУММА(втИтоговыеДанные.КоличествоПлановоеРозница)
	|	КОНЕЦ * 100 КАК ПроцентОбеспеченияРозница,
	|	ВЫБОР
	|		КОГДА СУММА(втИтоговыеДанные.КоличествоПлановоеECOM) = 0
	|			ТОГДА 0
	|		ИНАЧЕ СУММА(втИтоговыеДанные.КоличествоРаспределеноECOM) / СУММА(втИтоговыеДанные.КоличествоПлановоеECOM)
	|	КОНЕЦ * 100 КАК ПроцентОбеспеченияECOM
	|ПО
	|	Номенклатура";
	
	Распределение.Строки.Очистить();
	
	ЧисловыеКолонки =
	"КоличествоОстаток, КоличествоДоступно,
	|
	|КоличествоПлановоеОпт,		КоличествоПлановоеРозница,		КоличествоПлановоеECOM,
	|КоличествоРаспределеноОпт,	КоличествоРаспределеноРозница,	КоличествоРаспределеноECOM,
	|ПроцентОбеспеченияОпт,		ПроцентОбеспеченияРозница,		ПроцентОбеспеченияECOM";
	
	ВыборкаНоменклатура = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаНоменклатура.Следующий() Цикл
		
		СтрТабНом = Распределение.Строки.Добавить();
		
		СтрТабНом.НоменклатураХарактеристика = ВыборкаНоменклатура.Номенклатура;
		ЗаполнитьЗначенияСвойств(СтрТабНом, ВыборкаНоменклатура, ЧисловыеКолонки);
		
		ВыборкаХаракт = ВыборкаНоменклатура.Выбрать();
		Пока ВыборкаХаракт.Следующий() Цикл
			
			СтрТабХар = СтрТабНом.Строки.Добавить();
			СтрТабХар.Уровень = 1;
			СтрТабХар.НоменклатураХарактеристика = ВыборкаХаракт.Характеристика;
			ЗаполнитьЗначенияСвойств(СтрТабХар, ВыборкаХаракт, ЧисловыеКолонки);
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ЗаписатьРаспределение() Экспорт
	
	РезервироватьНоменклатуруДляРаспределения(ПодразделениеОпт,		"КоличествоДоступноОпт");
	РезервироватьНоменклатуруДляРаспределения(ПодразделениеРозница,	"КоличествоДоступноРозница");
	РезервироватьНоменклатуруДляРаспределения(ПодразделениеECOM,	"КоличествоДоступноECOM");
	
	Возврат Истина;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ИнициализироватьДеревоРаспределения()
	
	Если ЗначениеЗаполнено(Распределение.Колонки) Тогда
		Возврат;
	КонецЕсли;
	
	Распределение = Новый ДеревоЗначений;
	
	// Все доступные типы колонок для дерева распределения
	ТипНоменклатураХарактеристика = Новый ОписаниеТипов(
		"СправочникСсылка.Номенклатура, СправочникСсылка.ХарактеристикиНоменклатуры");
	ТипЧисло_15_3		= ОбщегоНазначения.ОписаниеТипаЧисло(15, 3);
	ТипЧисло_15_3_Плюс	= ОбщегоНазначения.ОписаниеТипаЧисло(15, 3, ДопустимыйЗнак.Неотрицательный);
	ТипЧисло_1_0		= ОбщегоНазначения.ОписаниеТипаЧисло(1, 0);

	Распределение.Колонки.Добавить("НоменклатураХарактеристика",	ТипНоменклатураХарактеристика);
	Распределение.Колонки.Добавить("КоличествоОстаток",				ТипЧисло_15_3);
	Распределение.Колонки.Добавить("КоличествоДоступно",			ТипЧисло_15_3);
	Распределение.Колонки.Добавить("КоличествоПлановоеОпт",			ТипЧисло_15_3);
	Распределение.Колонки.Добавить("КоличествоПлановоеРозница",		ТипЧисло_15_3);
	Распределение.Колонки.Добавить("КоличествоПлановоеECOM",		ТипЧисло_15_3);
	Распределение.Колонки.Добавить("КоличествоРаспределеноОпт",		ТипЧисло_15_3);
	Распределение.Колонки.Добавить("КоличествоРаспределеноРозница",	ТипЧисло_15_3);
	Распределение.Колонки.Добавить("КоличествоРаспределеноECOM",	ТипЧисло_15_3);
	Распределение.Колонки.Добавить("ПроцентОбеспеченияОпт",			ТипЧисло_15_3);
	Распределение.Колонки.Добавить("ПроцентОбеспеченияРозница",		ТипЧисло_15_3);
	Распределение.Колонки.Добавить("ПроцентОбеспеченияECOM",		ТипЧисло_15_3);
	Распределение.Колонки.Добавить("КоличествоДоступноОпт",			ТипЧисло_15_3_Плюс);
	Распределение.Колонки.Добавить("КоличествоДоступноРозница",		ТипЧисло_15_3_Плюс);
	Распределение.Колонки.Добавить("КоличествоДоступноECOM",		ТипЧисло_15_3_Плюс);
	Распределение.Колонки.Добавить("Уровень",						ТипЧисло_1_0);
	
КонецПроцедуры

Процедура РезервироватьНоменклатуруДляРаспределения(Подразделение, ПолеКоличество)
	
	Если НЕ ЗначениеЗаполнено(Распределение.Строки) Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Подразделение) Тогда
		Возврат;
	КонецЕсли;
	
	// Записывать распределение будем через "Документ.ЗаказНаВнутреннееПотребление".
	// Он позволяет зарезервировать товар, забрав его со свободного остатка - из колонки "КоличествоДоступно".
	// Товары, которые будут в этом документе попадут после проведения документа в колонки "КоличествоРаспределеноОпт",
	// "КоличествоРаспределеноРозница" и "КоличествоРаспределеноECOM" соответственно.
	
	// 1. Определим товары для обработки и достанем их вспомогательные реквизиты.
	ТоварыДляОбработки = Новый Массив;
	Для Каждого СтрДерТовар Из Распределение.Строки Цикл
		Если ЗначениеЗаполнено(СтрДерТовар[ПолеКоличество]) Тогда
			ТоварыДляОбработки.Добавить(СтрДерТовар.НоменклатураХарактеристика);
		КонецЕсли;
	КонецЦикла;
	
	НужныеРеквизитыТоваров = "Код, Наименование, ЕдиницаИзмерения, КоллекцияНоменклатуры";
	РеквизитыТоваров = ОбщегоНазначения.ЗначенияРеквизитовОбъектов(ТоварыДляОбработки, НужныеРеквизитыТоваров);
	
	// 2. Подготовим строки для записи, сгруппировав их по полю "КоллекцияНоменклатуры".
	// Нужны только строки, где заполнено "КолВоТовараКРаспределению".
	
	СтрокиКоллекций = Новый Соответствие;
	Для Каждого СтрДерТовар Из Распределение.Строки Цикл
		РеквизитыТовара = РеквизитыТоваров.Получить(СтрДерТовар.НоменклатураХарактеристика);
		Если РеквизитыТовара = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(РеквизитыТовара.КоллекцияНоменклатуры) Тогда
			ТекстОшибки = НСтр(
				"ru = 'Для товара [%1] (код = %2) не указана коллекция!'");
			ТекстОшибки = СтрШаблон(ТекстОшибки,
				РеквизитыТовара.Наименование, РеквизитыТовара.Код);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, СтрДерТовар.НоменклатураХарактеристика);
			ВызватьИсключение ТекстОшибки;
		КонецЕсли;
		
		СтрокиТекущейКоллеции = СтрокиКоллекций.Получить(РеквизитыТовара.КоллекцияНоменклатуры);
		Если СтрокиТекущейКоллеции = Неопределено Тогда
			СтрокиТекущейКоллеции = Новый Массив;
			СтрокиКоллекций.Вставить(РеквизитыТовара.КоллекцияНоменклатуры, СтрокиТекущейКоллеции);
		КонецЕсли;
		
		Для Каждого СтрДерХаракт Из СтрДерТовар.Строки Цикл
			Если ЗначениеЗаполнено(СтрДерХаракт[ПолеКоличество]) Тогда
				СтрокиТекущейКоллеции.Добавить(СтрДерХаракт);
			КонецЕсли;
		КонецЦикла;
		
	КонецЦикла;
	
	// 3. Теперь обрабатываем эти группы из п.2.
	// Для каждой группы до найти подходящий документ вида "Документ.ЗаказНаВнутреннееПотребление" по реквизитам:
	// - "Подразделение" = "ПодразделениеОпт"/"ПодразделениеРозница"/"ПодразделениеECOM"
	// - "КСП_Коллекция" = "КоллекцияНоменклатуры"
	// Чтобы не спутать с другими документами, ищем его по дополнительному реквизиту с именем
	// "ДокументРаспределенияГотовойПродукции" в ТЧ "Документ.ЗаказНаВнутреннееПотребление.ДополнительныеРеквизиты".
	// Если не находим - создаём новый.
	
	МенеджерДокумента = Документы.ЗаказНаВнутреннееПотребление;
	
	Для Каждого ДанныеКоллекции ИЗ СтрокиКоллекций Цикл
		
		НачатьТранзакцию(РежимУправленияБлокировкойДанных.Управляемый);
		
		КоллекцияНоменклатуры = ДанныеКоллекции.Ключ;
		СтрокиДерева = ДанныеКоллекции.Значение;
		
		ЗаказОбъект = ЗаказНаВнутреннееПотреблениеДляРезерва(Подразделение, КоллекцияНоменклатуры);
	
		// Дополняем ТЧ "Документ.ЗаказНаВнутреннееПотребление.Товары"
		
		// Служебные данные для обработки строки добавленного товара (урезанная бизнес-логика
		// из формы "Документ.ЗаказНаВнутреннееПотребление"
		ВариантОбеспеченияРезерв = Перечисления.ВариантыОбеспечения.СоСклада;
		СтруктураДействий = Новый Структура;
		СтруктураДействий.Вставить("ПересчитатьКоличествоЕдиниц");
	
		КэшированныеЗначения = ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруКэшируемыеЗначения();
		
		Для Каждого СтрДерХаракт Из СтрокиДерева Цикл
			
			СтрДерТовар = СтрДерХаракт.Родитель;
			
			ТекущийТовар = СтрДерТовар.НоменклатураХарактеристика;
			РеквизитыТовара = РеквизитыТоваров.Получить(ТекущийТовар);
			
			КолВоКРаспределению = СтрДерХаракт[ПолеКоличество];
			
			СтрокиТовара = ЗаказОбъект.Товары.НайтиСтроки(
				Новый Структура("Номенклатура, Характеристика", ТекущийТовар, СтрДерХаракт.НоменклатураХарактеристика));
			
			Если ЗначениеЗаполнено(СтрокиТовара) Тогда
				ТекущаяСтрока = СтрокиТовара[0];
				НовоеКоличество = ТекущаяСтрока.Количество + КолВоКРаспределению;
				
				Если НовоеКоличество < 0 Тогда
					ТекстОшибки = НСтр(
						"ru = 'Для товара [%1] (код = %2), характ-ка [%3] в [%4] будет отрицательное количество!'");
					ТекстОшибки = СтрШаблон(ТекстОшибки,
						РеквизитыТовара.Наименование,
						РеквизитыТовара.Код,
						СтрДерХаракт.НоменклатураХарактеристика,
						ЗаказОбъект);
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, ЗаказОбъект.Ссылка);
					ВызватьИсключение ТекстОшибки;
				КонецЕсли;
				
				ТекущаяСтрока.Количество			= НовоеКоличество;
				ТекущаяСтрока.КоличествоУпаковок	= НовоеКоличество;
				
			Иначе
				ТекущаяСтрока = ЗаказОбъект.Товары.Добавить();
				
				ТекущаяСтрока.Номенклатура			= ТекущийТовар;
				ТекущаяСтрока.Характеристика		= СтрДерХаракт.НоменклатураХарактеристика;
				ТекущаяСтрока.Упаковка				= РеквизитыТовара.ЕдиницаИзмерения;
				ТекущаяСтрока.Количество			= КолВоКРаспределению;
				ТекущаяСтрока.КоличествоУпаковок	= КолВоКРаспределению;
				ТекущаяСтрока.ВариантОбеспечения	= ВариантОбеспеченияРезерв;
				
			КонецЕсли;
			
			ОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения);
			
		КонецЦикла;
	
		// 3. Проводим документ, он должен убрать из свободного остатка выбранные товары
		
		Если (ЗаказОбъект.ЭтоНовый() И ЗначениеЗаполнено(ЗаказОбъект.Товары))
			ИЛИ (НЕ ЗаказОбъект.ЭтоНовый() И ЗаказОбъект.Модифицированность()) Тогда
			
			МенеджерДокумента.КСП_УстановитьДопСвойствоДиспетчераРаспределенияГотовойПродукции(ЗаказОбъект);
			Если ЗначениеЗаполнено(ЗаказОбъект.Товары) Тогда
				ЗаказОбъект.Записать(РежимЗаписиДокумента.Проведение);
			Иначе
				ЗаказОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);  // оставим его просто записанным
			КонецЕсли;
			
		КонецЕсли;
		
		ЗафиксироватьТранзакцию();
		
	КонецЦикла;
	
КонецПроцедуры

Функция ЗаказНаВнутреннееПотреблениеДляРезерва(Подразделение, КоллекцияНоменклатуры)
	
	ТипДокументаРезерва = ОбщегоНазначения.ПредопределенныйЭлемент(
		"Перечисление.КСП_ТипДокументаСлужебногоРезерва.РаспределениеГотовойПродукции");
	
	//Запрос = Новый Запрос;
	//Запрос.УстановитьПараметр("Подразделение",			Подразделение);
	//Запрос.УстановитьПараметр("КоллекцияНоменклатуры",	КоллекцияНоменклатуры);
	//Запрос.УстановитьПараметр("ТипДокумента",			ТипДокументаРезерва);
	//
	//Запрос.Текст =
	//"ВЫБРАТь
	//|	Док.Ссылка
	//|ИЗ
	//|	Документ.ЗаказНаВнутреннееПотребление КАК Док
	//|ГДЕ
	//|	Док.Подразделение = &Подразделение
	//|	И Док.КСП_Коллекция = &КоллекцияНоменклатуры
	//|	И Док.КСП_ТипДокументаСлужебногоРезерва = &ТипДокумента
	//|	И НЕ Док.ПометкаУдаления
	//|";
	//
	//Выборка = Запрос.Выполнить().Выбрать();
	//Если Выборка.Количество() > 1 Тогда
	//	ТекстОшибки = НСтр(
	//		"ru = 'Найдено более одного документа для распределения готовой продукции коллекции [%1] подразделения [%2]'");
	//	ВызватьИсключение СтрШаблон(ТекстОшибки, КоллекцияНоменклатуры, Подразделение);
	//ИначеЕсли Выборка.Следующий() Тогда
	//	Возврат Выборка.Ссылка.ПолучитьОбъект();
	//КонецЕсли;
	
	ЗаказОбъект = Документы.ЗаказНаВнутреннееПотребление.СоздатьДокумент();
	
	ЗаказОбъект.Дата					= ТекущаяДатаСеанса();
	ЗаказОбъект.Приоритет				= Справочники.Приоритеты.НайтиПоНаименованию("Средний");
	ЗаказОбъект.ХозяйственнаяОперация	= Перечисления.ХозяйственныеОперации.СписаниеТоваровПоТребованию;
	ЗаказОбъект.Организация				= Организация;
	ЗаказОбъект.Склад					= СкладОстатков;
	ЗаказОбъект.Подразделение			= Подразделение;
	ЗаказОбъект.Ответственный			= ПараметрыСеанса.ТекущийПользователь;
	
	ЗаказОбъект.КСП_Коллекция						= КоллекцияНоменклатуры;
	ЗаказОбъект.КСП_ТипДокументаСлужебногоРезерва	= ТипДокументаРезерва;
	
	ЗаказОбъект.Комментарий = "Создан автоматически обработкой 'Диспетчер распределения готовой продукции'";
	
	
	Возврат ЗаказОбъект;
	
КонецФункции

#КонецОбласти
